# Pandas Basics

In [1]:
import pandas as pd
import numpy as np
pd.__version__

'1.3.4'

## Pandas Series

In [2]:
data = pd.Series([0.25, 0.5, 0.75, 1.0], index=['a', 'b', 'c', 'd'])
data

a    0.25
b    0.50
c    0.75
d    1.00
dtype: float64

In [4]:
data.values

array([0.25, 0.5 , 0.75, 1.  ])

In [5]:
data.index

Index(['a', 'b', 'c', 'd'], dtype='object')

Clearly a Pandas `Series` is similar to a Python dictionary

In [6]:
data_dict = {'a': 0.25, 'b': 0.5, 'c': 0.75, 'd': 1.0}
data = pd.Series(data_dict)
data

a    0.25
b    0.50
c    0.75
d    1.00
dtype: float64

`Series` can be viewed as dictionary with typed values and typed indeces. Typing makes it more efficient than the original dictionary.

## Pandas DataFrame

In [7]:
area = pd.Series({'California': 423967, 'Texas': 695662,
                          'New York': 141297, 'Florida': 170312,
                          'Illinois': 149995})
pop = pd.Series({'California': 38332521, 'Texas': 26448193,
                         'New York': 19651127, 'Florida': 19552860,
                         'Illinois': 12882135})

In [8]:
table = pd.DataFrame({'area':area, 'pop':pop})
table

              area       pop
California  423967  38332521
Texas       695662  26448193
New York    141297  19651127
Florida     170312  19552860
Illinois    149995  12882135

In [9]:
table.index

Index(['California', 'Texas', 'New York', 'Florida', 'Illinois'], dtype='object')

In [10]:
table.columns

Index(['area', 'pop'], dtype='object')

In [12]:
type(table.values)

numpy.ndarray

## Indexing & Selection

In [13]:
data

a    0.25
b    0.50
c    0.75
d    1.00
dtype: float64

In [14]:
data['b':'d']
# explicit index; final index included

b    0.50
c    0.75
d    1.00
dtype: float64

In [20]:
data[0]
# implicit index; final index excluded

0.25

In [16]:
data[(data > 0.3) & (data < 0.8)]
# masking

b    0.50
c    0.75
dtype: float64

Integer indices can cause confusion.

In [17]:
data_2 = pd.Series(['a', 'b', 'c'], index=[1, 3, 5])
data_2

1    a
3    b
5    c
dtype: object

In [22]:
data_2[1]

'a'

In [29]:
data_2[1:3]

3    b
5    c
dtype: object

To make slicing more explicit, we use `loc` and `iloc`

In [23]:
data_2.loc[1:3]

1    a
3    b
dtype: object

In [24]:
data_2.iloc[1:3]

3    b
5    c
dtype: object

Explicit is always better implicit.

In [26]:
table

              area       pop
California  423967  38332521
Texas       695662  26448193
New York    141297  19651127
Florida     170312  19552860
Illinois    149995  12882135

In [27]:
table.iloc[:3, :2]

              area       pop
California  423967  38332521
Texas       695662  26448193
New York    141297  19651127

In [35]:
table.loc[:'Illinois', :'pop']

              area       pop
California  423967  38332521
Texas       695662  26448193
New York    141297  19651127
Florida     170312  19552860
Illinois    149995  12882135

In [30]:
table['area']

California    423967
Texas         695662
New York      141297
Florida       170312
Illinois      149995
Name: area, dtype: int64

In [32]:
table[['area']]

              area
California  423967
Texas       695662
New York    141297
Florida     170312
Illinois    149995

In [35]:
table[table['pop'] > 20000000]

              area       pop
California  423967  38332521
Texas       695662  26448193

## Aggregation & Grouping

We use the Planets dataset available in Seaborn package as an example

In [36]:
import seaborn as sns
planets = sns.load_dataset('planets')
planets.shape

(1035, 6)

In [37]:
planets.head()

            method  number  orbital_period   mass  distance  year
0  Radial Velocity       1         269.300   7.10     77.40  2006
1  Radial Velocity       1         874.774   2.21     56.95  2008
2  Radial Velocity       1         763.000   2.60     19.84  2011
3  Radial Velocity       1         326.030  19.40    110.62  2007
4  Radial Velocity       1         516.220  10.50    119.47  2009

### Simple aggregation

In [42]:
planets.dropna().describe()

          number  orbital_period        mass    distance         year
count  498.00000      498.000000  498.000000  498.000000   498.000000
mean     1.73494      835.778671    2.509320   52.068213  2007.377510
std      1.17572     1469.128259    3.636274   46.596041     4.167284
min      1.00000        1.328300    0.003600    1.350000  1989.000000
25%      1.00000       38.272250    0.212500   24.497500  2005.000000
50%      1.00000      357.000000    1.245000   39.940000  2009.000000
75%      2.00000      999.600000    2.867500   59.332500  2011.000000
max      6.00000    17337.500000   25.000000  354.000000  2014.000000

In [40]:
planets['number'].mean(skipna=True)
# What's wrong?

1.7855072463768116

The following table summarizes some other built-in Pandas aggregations:

| Aggregation              | Description                     |
|--------------------------|---------------------------------|
| ``count()``              | Total number of items           |
| ``first()``, ``last()``  | First and last item             |
| ``mean()``, ``median()`` | Mean and median                 |
| ``min()``, ``max()``     | Minimum and maximum             |
| ``std()``, ``var()``     | Standard deviation and variance |
| ``mad()``                | Mean absolute deviation         |
| ``prod()``               | Product of all items            |
| ``sum()``                | Sum of all items                |

### Groupby: conditional aggregation

Often the variable you need has to be constructed. This is part of 'cleaning'. 

<img src="./img/split-apply-combine.png" alt="drawing" width="600"/>

In [43]:
df = pd.DataFrame({'key': ['A', 'B', 'C', 'A', 'B', 'C'],
                   'data': range(6)}, columns=['key', 'data'])
df

  key  data
0   A     0
1   B     1
2   C     2
3   A     3
4   B     4
5   C     5

In [44]:
df.groupby('key').sum()

     data
key
A       3
B       5
C       7

In [77]:
planets.head()

            method  number  orbital_period   mass  distance  year
0  Radial Velocity       1         269.300   7.10     77.40  2006
1  Radial Velocity       1         874.774   2.21     56.95  2008
2  Radial Velocity       1         763.000   2.60     19.84  2011
3  Radial Velocity       1         326.030  19.40    110.62  2007
4  Radial Velocity       1         516.220  10.50    119.47  2009

In [45]:
planets.groupby('method')['orbital_period'].median()

method
Astrometry                         631.180000
Eclipse Timing Variations         4343.500000
Imaging                          27500.000000
Microlensing                      3300.000000
Orbital Brightness Modulation        0.342887
Pulsar Timing                       66.541900
Pulsation Timing Variations       1170.000000
Radial Velocity                    360.200000
Transit                              5.714932
Transit Timing Variations           57.011000
Name: orbital_period, dtype: float64

In [79]:
planets.groupby('method')

# Not exactly a DataFrame (for efficiency reasons), but you can treat it as similar.

## Afterword 

- The material in this notebook is mainly drawn from Chapter 3 of [Python Data Science Handbook](https://jakevdp.github.io/PythonDataScienceHandbook/index.html) by Jake VanderPlas — Much more to learn!
- For similar functions and tools in R, see [R for Data Science](https://r4ds.had.co.nz/index.html) — You may find tidyverse in R a better interface for data cleaning than Pandas (I do).